id: f2904019-85d2-4621-8220-57962a98df01
name: Test
description: |
  'Test'
severity: High
requiredDataConnectors:
  - connectorId: DNS
    dataTypes:
      - DnsEvents
  - connectorId: AzureMonitor(VMInsights) 
    dataTypes:
      - VMConnection
  - connectorId: CiscoASA
    dataTypes:
      - CommonSecurityLog
  - connectorId: PaloAltoNetworks
    dataTypes:
      - CommonSecurityLog
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CommandAndControl
  - CredentialAccess
query: |

  SecurityAlert
  | where TimeGenerated > ago(7d)
  | mv-expand parse_json(ExtendedProperties)
  | where todynamic(ExtendedProperties.Status) =~ "New"
  | extend status = todynamic(ExtendedProperties.Status)